{
  "title": "Frequently Asked Questions",
  "content": "**What is cloud-based bookkeeping and accounting**\n\nCloud-based bookkeeping and accounting is a very efficient and cost-effective way of doing your books. Your bank and credit card accounts are connected to your QBO file, and we automagically, in real-time, do your books. This saves you time that you can use to focus on running your business, or perhaps even taking time off.\n\n**Can I talk with a human?**\n\nYes! When you sign up with Safe Haven Accounting, you get a dedicated bookkeeper on your team. You can communicate with them via email, text, phone, online chat or video conference. Whatever works best for you.\n\n**How do I know what package I need?**\n\nOur plans are based upon two things; the number of monthly transactions and the number of accounts to be reconciled. “Transactions” are the number of credits and debits on your bank account(s), credit card(s), and 3rd party apps (if they are connected to your QBO file). You can calculate this by going to your various accounts and counting the total number of credits and debits. Number of accounts will include business checking and savings accounts, business credit cards, and any third party accounts (like PayPal, Stripe, Square, etc). Based on this you will be able to see which package you would fall under. If you can’t find a package to fit your needs, request a consultation so we can custom build your package.\n\n**What makes Safe Haven Accounting different from other bookkeeping services?**\n\nWe want to build a relationship with you. Our approach is to understand your business, your personal ambitions and the industry in which you compete. We believe this provides our clients with a personal service, designed just for them. We offer customized packages that fit your business and we understand not every business has the same needs.\n\n**What does my bookkeeper do?**\n\nYour bookkeeping professional categorizes your transactions, reconciles your accounts monthly, and produces your financial statements. They also make adjustments to your books to ensure they’re compliant. A bookkeeper might need your input on things like categorizing a transaction properly, but we try our best to make bookkeeping as hands-off as possible for you. At Safe Haven Accounting, we offer various packages to fit your needs. Please check out our services page or book a consultation with us.\n\n**Can I keep track of my business mileage?**\n\nYes, you can track all of the details you need to document your mileage for your tax purposes. Track one or multiple vehicles, your mileage, dates of your business trips, locations and the purpose of each trip all with the ability to pull detailed reports, all within the QBO app. The QBO app is included in every package.\n\n**What’s the difference between a Bookkeeper and an CPA?**\n\nBookkeepers and CPA’s share a lot of the same duties but they are, in fact, not the same. Bookkeepers deal with day to day tasks, such as recording sales, posting expenses, conducting payroll, and so on. CPA’s focus on the income tax strategies for your business. In other words, bookkeepers take all the financial information happening daily and prepare financial statements, where the CPA takes that already organized information and gives tax advice. We do not file your taxes, but we do keep your books ready to go and can send the data directly to your CPA or accountant when tax season rolls around. This means that not only will you better know how much you will owe the IRS, but also that you won’t have to clean up your books last minute, when tax time comes! If you do not already have a tax professional, we can refer you to one of our tax professional partners.\n\n**What about contracts?**\n\nOur services are based upon one year contracts. This allows us to have a low fee for your initial setup and keep monthly costs as low as possible. We review your books for your average amount of transactions every 90 days. If you are capping the transaction maximum, we will communicate with you about adjusting your package. We want to help you create your financial safe haven, so you can thrive!",
  "subtitle": "Your Frequently Asked Questions about Bookkeeping Answered"
}